In [3]:
import pandas as pd
import sqlite3

In [10]:
conn = sqlite3.connect('pets.db')
c = conn.cursor()

In [14]:
!ls

3_2_sql_joins.md            dogs.db
Untitled.ipynb              owners.db
cat_dog_owner_sqlite3.ipynb pets.db
cats.db

In [15]:
c.execute ('''select name from sqlite_master where type = 'table';''').fetchall()

[('owners',), ('dogs',), ('cats',)]

In [13]:
c.execute('''SELECT *
             FROM sqlite_master
             WHERE type='table';''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

,type,name,tbl_name,rootpage,sql
0,table,owners,owners,2,"CREATE TABLE owners(\n ""Name"" TEXT,\n ""Phone..."
1,table,dogs,dogs,3,"CREATE TABLE dogs(\n ""Name"" TEXT,\n ""Breed"" ..."
2,table,cats,cats,4,"CREATE TABLE cats(\n ""Name"" TEXT,\n ""Breed"" ..."

In [96]:
#c.execute('''SELECT *
             #FROM dogs;''')
# df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
#df.columns = [i[0] for i in c.description]
#df.head()

In [11]:
 c.execute('''SELECT *
              FROM cats;''')
 df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
 df.columns = [i[0] for i in c.description]
 df.head()

       Name         Breed House_Number Owner_ID
0      Bell       Siamese            1        4
1   Jackson      Balinese            2        3
2  Precious     Himalayan            3        4
3     Rocky  Egyptian Mau            4        2
4    Samson      Javanese            5        1

In [6]:
c.execute('''SELECT *
             FROM dogs;''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

       Name             Breed House_Number Owner_ID
0       Rex         Chihuahua            1        3
1  Clifford   German Shepherd            2        2
2     Lucky          Daschund            3        1
3      Bobo          Shih-Tzu            2        4
4     Buddy  Golden Retriever            4        2

In [8]:
c.execute('''SELECT *
             FROM owners;''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

                     Name       Phone            Address ID
0            Josh Daniell  3132879573         1440 G st.  1
1  Alison Peebles Madigan  2147098190               None  2
2            Avi Flombaum  4698780125  1776 New York Ave  3
3           Justin Bieber  4103810987               None  4

In [16]:
#A. Write a SQL query that can grab the names of all pets owned by the founder of Flatiron School, Avi Flombaum

c.execute('''SELECT owners.Name as ownerName, dogs.Name as dogName, cats.Name as catName
             FROM owners JOIN dogs ON owners.ID = dogs.Owner_ID
                         JOIN cats ON owners.ID = cats.Owner_ID;
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head(30)

                ownerName   dogName   catName
0            Josh Daniell     Lucky    Samson
1  Alison Peebles Madigan     Buddy     Rocky
2  Alison Peebles Madigan  Clifford     Rocky
3  Alison Peebles Madigan       Leo     Rocky
4            Avi Flombaum       Rex   Jackson
5           Justin Bieber      Bobo      Bell
6           Justin Bieber      Bobo  Precious

In [58]:
#A. Write a SQL query that can grab the names of all pets owned by the founder of Flatiron School, Avi Flombaum
c.execute('''SELECT owners.Name as ownerName, dogs.Name as dogName, cats.Name as catName
             FROM owners JOIN dogs ON owners.ID = dogs.Owner_ID
                         JOIN cats ON owners.ID = cats.Owner_ID
             WHERE owners.Name = 'Avi Flombaum';
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

      ownerName dogName  catName
0  Avi Flombaum     Rex  Jackson

In [73]:
#B. Which House_Number contains the most number of pets in it and how many?
c.execute('''SELECT owners.Name, count(*)
             FROM owners JOIN dogs ON owners.ID = dogs.Owner_ID
                         JOIN cats ON owners.ID = cats.Owner_ID
             GROUP BY  owners.Name;
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

                     Name  count(*)
0  Alison Peebles Madigan         3
1            Avi Flombaum         1
2            Josh Daniell         1
3           Justin Bieber         2

In [34]:
#B. How many pets each House_Number contains?
c.execute('''SELECT Owner_ID, House_Number, count(*) as Total_Pets
             FROM
                 (
                 SELECT *
                 FROM dogs
                 UNION
                 SELECT *
                 FROM cats
                 UNION
                 SELECT *
                 FROM owners
                 )
             GROUP BY House_Number;
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head(10)

  Owner_ID       House_Number  Total_Pets
0        4                  1           3
1        1         1440 G st.           1
2        3  1776 New York Ave           1
3        4                  2           3
4        1                  3           2
5        2                  4           2
6        1                  5           1
7        2               None           2

In [ ]:
c.execute('''SELECT Owner_ID, House_Number, count(*) as Total_Pets
             FROM
                 (
                 SELECT *
                 FROM dogs
                 UNION
                 SELECT *
                 FROM cats
                 UNION
                 SELECT *
                 FROM owners
                 )
             GROUP BY House_Number;
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head(10)

In [20]:
#B. Which House_Number contains the most number of pets in it and how many?
c.execute('''SELECT House_Number, count(*) as Total_Pets
             FROM
                 (
                 SELECT *
                 FROM dogs
                 UNION
                 SELECT *
                 FROM cats
                 )
             GROUP BY House_Number
             ORDER BY Total_Pets DESC
             LIMIT 1;
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head(10)

  House_Number  Total_Pets
0            1           3

In [21]:
#B. Which House_Number contains the most number of pets in it and how many?
c.execute('''SELECT *
             FROM
                 (
                 SELECT *
                 FROM dogs
                 UNION
                 SELECT *
                 FROM cats
                 )
             --GROUP BY House_Number
             --ORDER BY Total_Pets DESC
             --LIMIT 1;
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head(10)

       Name             Breed House_Number Owner_ID
0      Bell           Siamese            1        4
1      Bobo          Shih-Tzu            2        4
2     Buddy  Golden Retriever            4        2
3  Clifford   German Shepherd            2        2
4   Jackson          Balinese            2        3
5       Leo   English Bulldog            1        2
6     Lucky          Daschund            3        1
7  Precious         Himalayan            3        4
8       Rex         Chihuahua            1        3
9     Rocky      Egyptian Mau            4        2

In [26]:
#B. Which House_Number contains the most number of pets in it and how many?
c.execute('''SELECT *, count(House_Number)
             FROM
                 (
                 SELECT *
                 FROM dogs
                 UNION
                 SELECT *
                 FROM cats
                 )
             GROUP BY House_Number
             WHERE House_Number = 4;
             
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head(10)

OperationalError: near "WHERE": syntax error

In [95]:
c.execute('''SELECT House_Number, dogs.Name, cats.Name
             FROM
                 (
                 SELECT *
                 FROM dogs
                 UNION
                 SELECT *
                 FROM cats
                 )
             WHERE House_Number = '4';
          ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
print("need to update addresses")
df.head()

OperationalError: no such column: dogs.Name

In [29]:
#Grab the names and phone numbers of owners with pets in house 4 that do not currently have an address.

c.execute('''SELECT Owners.Name, Phone, Address, House_Number
             FROM owners JOIN dogs ON owners.ID = dogs.Owner_ID
                         JOIN cats ON owners.ID = cats.Owner_ID
             WHERE dogs.House_Number = 4 | cats.House_Number =4;
                
             ''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

OperationalError: ambiguous column name: House_Number